# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name RC_Extraction_WC -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0} -qx_tech_file {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/qrc/qx/gpdk045.tch}
create_rc_corner -name RC_Extraction_BC -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0} -qx_tech_file {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/qrc/qx/gpdk045.tch}
#create_library_set -name Lib_Set_BC -timing {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/fast_vdd1v2_basicCells.lib /CMC/kits/cadence/GPDK045/giolib045_v3.3/lib/pads_SS_s1vg.lib /CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/fast_vdd1v2_multibitsDFF.lib}
#create_library_set -name Lib_Set_WC -timing {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/slow_vdd1v0_basicCells.lib /CMC/kits/cadence/GPDK045/giolib045_v3.3/lib/pads_SS_s1vg.lib /CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/slow_vdd1v0_multibitsDFF.lib}
create_library_set -name Lib_Set_BC -timing {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/fast_vdd1v2_basicCells.lib /CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/fast_vdd1v2_multibitsDFF.lib /CMC/kits/cadence/GPDK045/giolib045_v3.3/lib/pads_FF_s1vg.lib}
create_library_set -name Lib_Set_WC -timing {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/slow_vdd1v0_basicCells.lib /CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/slow_vdd1v0_multibitsDFF.lib /CMC/kits/cadence/GPDK045/giolib045_v3.3/lib/pads_SS_s1vg.lib}
create_constraint_mode -name ConstraintMode_WC -sdc_files {../Innovus_inputs/risc_v_Pad_Frame_opt.CM_risc_v_slow.sdc}
create_constraint_mode -name ConstraintMode_BC -sdc_files {../Innovus_inputs/risc_v_Pad_Frame_opt.CM_risc_v_fast.sdc}
create_delay_corner -name DelayCorner_WC -library_set {Lib_Set_WC} -rc_corner {RC_Extraction_WC}
create_delay_corner -name DelayCorner_BC -library_set {Lib_Set_BC} -rc_corner {RC_Extraction_BC}
create_analysis_view -name AnalysisView_WC -constraint_mode {ConstraintMode_WC} -delay_corner {DelayCorner_WC}
create_analysis_view -name AnalysisView_BC -constraint_mode {ConstraintMode_BC} -delay_corner {DelayCorner_BC}
set_analysis_view -setup {AnalysisView_WC AnalysisView_BC} -hold {AnalysisView_WC AnalysisView_BC}
