###############################################################
#  Generated by:      Cadence Innovus 21.12-s106_1
#  OS:                Linux x86_64(Host ID iteso-server)
#  Generated on:      Tue Nov 28 20:21:05 2023
#  Design:            risc_v_Pad_Frame
#  Command:           routeDesign -globalDetail
###############################################################
current_design risc_v_Pad_Frame
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name My_CLK -period 10.000000 -waveform {0.000000 5.000000}
set_clock_transition  -rise -min 0.4 [get_clocks {My_CLK}]
set_clock_transition  -rise -max 0.55 [get_clocks {My_CLK}]
set_clock_transition  -fall -min 0.3 [get_clocks {My_CLK}]
set_clock_transition  -fall -max 0.5 [get_clocks {My_CLK}]
set_propagated_clock  [get_ports {clk}]
set_load -pin_load -max  0.005  [get_ports {tx}]
set_load -pin_load -min  0.005  [get_ports {tx}]
set_max_capacitance 0.005  [get_ports {tx}]
set_max_fanout 15  [get_designs {risc_v_Pad_Frame}]
set_input_delay -add_delay 0.1 -clock [get_clocks {My_CLK}] [get_ports {rx}]
set_input_delay -add_delay 0.1 -clock [get_clocks {My_CLK}] [get_ports {rst_n}]
set_output_delay -add_delay 0.1 -clock [get_clocks {My_CLK}] [get_ports {tx}]
set_clock_uncertainty 0.05 -hold [get_clocks {My_CLK}]
set_clock_uncertainty 0.1 -setup [get_clocks {My_CLK}]
